Revit 2024 API
SweptBlend.BottomProfileSymbol Property
The bottom family symbol profile of the swept blend.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public FamilySymbolProfile BottomProfileSymbol { get; }
Visual Basic
Public ReadOnly Property BottomProfileSymbol As FamilySymbolProfile
	Get
Visual C++
public:
property FamilySymbolProfile^ BottomProfileSymbol {
	FamilySymbolProfile^ get ();
}
Remarks
If the bottom profile is sketch-based, this property is null.
See Also
SweptBlend Class
Autodesk.Revit.DB Namespace